; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	infrared3 - mode
	infrared0 - mode
	spectrograph1 - mode
	image2 - mode
	spectrograph4 - mode
	Star0 - direction
	Star2 - direction
	GroundStation1 - direction
	Planet3 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
	(supports instrument2 infrared3)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star2)
	(supports instrument3 spectrograph4)
	(supports instrument3 infrared3)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star0)
	(supports instrument4 image2)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star0)
	(supports instrument5 spectrograph1)
	(supports instrument5 infrared3)
	(supports instrument5 image2)
	(calibration_target instrument5 Star2)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star7)
	(supports instrument6 spectrograph1)
	(supports instrument6 image2)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star2)
	(supports instrument7 spectrograph4)
	(supports instrument7 image2)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star13)
)
(:goal (and
	(pointing satellite0 Star13)
	(pointing satellite2 Star5)
	(have_image Planet3 image2)
	(have_image Star4 spectrograph4)
	(have_image Star5 spectrograph4)
	(have_image Star6 spectrograph4)
	(have_image Star7 spectrograph4)
	(have_image Planet8 infrared3)
	(have_image Planet9 infrared3)
	(have_image Phenomenon10 image2)
	(have_image Phenomenon11 infrared0)
	(have_image Planet12 infrared0)
	(have_image Star13 spectrograph4)
))

)

; plan
1. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 0 of 13
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 13
3. (calibrate satellite2 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 0 of 13
4. (turn_to satellite4 phenomenon10 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 13
5. (turn_to satellite4 star2 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 star2)
   goals met: 0 of 13
6. (calibrate satellite4 instrument6 star2)
   added: (calibrated instrument6)
   goals met: 0 of 13
7. (turn_to satellite4 phenomenon10 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon10)
   goals met: 0 of 13
8. (take_image satellite4 phenomenon10 instrument6 image2)
   added: (have_image phenomenon10 image2)
   goals met: 1 of 13
9. (turn_to satellite4 phenomenon11 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 phenomenon11)
   goals met: 1 of 13
10. (take_image satellite4 phenomenon11 instrument6 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 2 of 13
11. (turn_to satellite4 planet12 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 planet12)
   goals met: 2 of 13
12. (take_image satellite4 planet12 instrument6 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 3 of 13
13. (turn_to satellite4 planet3 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 planet3)
   goals met: 3 of 13
14. (take_image satellite4 planet3 instrument6 image2)
   added: (have_image planet3 image2)
   goals met: 4 of 13
15. (turn_to satellite2 planet8 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet8)
   goals met: 4 of 13
16. (take_image satellite2 planet8 instrument3 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 5 of 13
17. (turn_to satellite2 planet9 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 planet9)
   goals met: 5 of 13
18. (take_image satellite2 planet9 instrument3 infrared3)
   added: (have_image planet9 infrared3)
   goals met: 6 of 13
19. (turn_to satellite2 star13 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star13)
   goals met: 6 of 13
20. (take_image satellite2 star13 instrument3 spectrograph4)
   added: (have_image star13 spectrograph4)
   goals met: 7 of 13
21. (turn_to satellite2 star4 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star4)
   goals met: 7 of 13
22. (take_image satellite2 star4 instrument3 spectrograph4)
   added: (have_image star4 spectrograph4)
   goals met: 8 of 13
23. (turn_to satellite2 star5 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 star5)
   goals met: 9 of 13
24. (take_image satellite2 star5 instrument3 spectrograph4)
   added: (have_image star5 spectrograph4)
   goals met: 10 of 13
25. (turn_to satellite0 star13 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star13)
   goals met: 11 of 13
26. (turn_to satellite2 star6 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 star6)
   goals met: 10 of 13
27. (take_image satellite2 star6 instrument3 spectrograph4)
   added: (have_image star6 spectrograph4)
   goals met: 11 of 13
28. (turn_to satellite2 star5 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star5)
   goals met: 12 of 13
29. (turn_to satellite2 star7 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 star7)
   goals met: 11 of 13
30. (take_image satellite2 star7 instrument3 spectrograph4)
   added: (have_image star7 spectrograph4)
   goals met: 12 of 13
31. (turn_to satellite2 star5 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 star5)
   goals met: 13 of 13
